Revit 2026 API

# ColorFillSchemeGetFormatOptions Method

---

Returns the FormatOptions of the scheme.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FormatOptions GetFormatOptions()
```
```vb
Public Function GetFormatOptions As FormatOptions
```
```cpp
public:
FormatOptions^ GetFormatOptions()
```
```fsharp
member GetFormatOptions : unit -> FormatOptions
```

#### Return Value

FormatOptions

This method will return the default FormatOptions if the scheme is by value.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace